In [3]:
%matplotlib inline
import pandas as pd

In [11]:
#from IPython.core.display import HTML
#css = open('style-table.css').read() + open('style-notebook.css').read()
#HTML('<style>{}</style>'.format(css))

In [8]:
titles = pd.read_csv('E:\Machine Learning\AIML\CLASS\DAY_17/titles.csv')
titles.head()

                  title  year
0    Tasveer Mere Sanam  1996
1              Only You  1994
2  El pueblo del terror  1970
3               Machine  2007
4                  MARy  2008

In [2]:

pwd

'E:\\Machine Learning\\AIML\\CLASS\\DAY_17'

In [13]:
cast=pd.read_csv('E:\Machine Learning\AIML\CLASS\DAY_17/cast.csv', index_col=None)
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

### How many movies are listed in the titles dataframe?

In [12]:
len(titles)

244914

### What are the earliest two films listed in the titles dataframe?

In [14]:
titles.sort_values('year').head(2)

                     title  year
193222          Miss Jerry  1894
51388   The Startled Lover  1898

### How many movies have the title "Hamlet"?

In [15]:

len(titles[titles.title == 'Hamlet'])

20

### How many movies are titled "North by Northwest"?

In [16]:
len(titles[titles.title == 'North by Northwest'])

1

### When was the first movie titled "Hamlet" made?

In [17]:
titles[titles.title == 'Hamlet'].sort_values('year').head(1)

        title  year
52521  Hamlet  1910

### List all of the "Treasure Island" movies from earliest to most recent.

In [18]:
titles[titles.title == 'Treasure Island'].sort_values('year')

                  title  year
55686   Treasure Island  1918
196514  Treasure Island  1920
141822  Treasure Island  1934
77354   Treasure Island  1950
65051   Treasure Island  1972
37238   Treasure Island  1973
173051  Treasure Island  1985
27076   Treasure Island  1999

### How many movies were made in the year 1950?

In [19]:
len(titles[titles.year==1950])

1113

### How many movies were made in the year 1960?

In [20]:
len(titles[titles.year==1960])

1549

### How many movies were made from 1950 through 1959?

In [21]:

len(titles[(1950<=titles.year)&(titles.year<=1959)])

12934

### In what years has a movie titled "Batman" been released?

In [22]:
titles[titles.title=='Batman']

         title  year
39349   Batman  1943
240896  Batman  1989

### How many roles were there in the movie "Inception"?

In [23]:
titles[titles.title == 'Inception']

            title  year
183910  Inception  2010

In [24]:
c=cast
len(c[c.title=='Inception'])

78

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [25]:
c=cast
c=c[c.title=='Inception']
c=c[c.n.isnull()]
len(c)

27

### But how many roles in the movie "Inception" did receive an "n" value?

In [26]:
c=cast
c=c[c.title=='Inception']
c=c[c.n.notnull()]
len(c)

51

In [27]:
cast=pd.read_csv('E:\Machine Learning\AIML\CLASS\DAY_17/cast.csv', index_col=None)
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [36]:
c=cast
c=c[c.title=='North by Northwest']
d=c[c.n.notnull()]
len(d)
print(d)

                      title  year                  name     type  \
206471   North by Northwest  1959          Edward Binns    actor
356707   North by Northwest  1959        Leo G. Carroll    actor
464736   North by Northwest  1959       Philip Coolidge    actor
665768   North by Northwest  1959     Robert Ellenstein    actor
871426   North by Northwest  1959            Cary Grant    actor
1275337  North by Northwest  1959         Martin Landau    actor
1384780  North by Northwest  1959             Ken Lynch    actor
1457165  North by Northwest  1959           James Mason    actor
1508344  North by Northwest  1959         Patrick McVey    actor
1695173  North by Northwest  1959           Philip Ober    actor
1811387  North by Northwest  1959          Edward Platt    actor
2295714  North by Northwest  1959          Les Tremayne    actor
2447081  North by Northwest  1959         Adam Williams    actor
3048272  North by Northwest  1959  Josephine Hutchinson  actress
3157232  North by Northwest  1959   Jessie Royce Landis  actress
3518333  North by Northwest  1959       Eva Marie Saint  actress

                           character     n
206471                Captain Junket  15.0
356707                 The Professor   5.0
464736                     Dr. Cross  13.0
665768                         Licht  11.0
871426            Roger O. Thornhill   1.0
1275337                      Leonard   8.0
1384780  Charley - Chicago Policeman  16.0
1457165              Phillip Vandamm   3.0
1508344               Sergeant Flamm  14.0
1695173              Lester Townsend   7.0
1811387              Victor Larrabee  10.0
2295714                   Auctioneer  12.0
2447081                     Valerian   9.0
3048272                Mrs. Townsend   6.0
3157232              Clara Thornhill   4.0
3518333                  Eve Kendall   2.0

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [37]:
c=cast
c=c[c.title=='Sleuth']
#d=c[c.n.isnull()]
#len(d)
print(c)

          title  year                 name     type  \
260242   Sleuth  2007      Kenneth Branagh    actor
326773   Sleuth  1972        Michael Caine    actor
326774   Sleuth  2007        Michael Caine    actor
373876   Sleuth  1972       Alec Cawthorne    actor
373877   Sleuth  2007  Alec (II) Cawthorne    actor
1293634  Sleuth  2007             Jude Law    actor
1448690  Sleuth  1972         Teddy Martin    actor
1465483  Sleuth  1972   John (II) Matthews    actor
1705394  Sleuth  1972     Laurence Olivier    actor
1805907  Sleuth  2007        Harold Pinter    actor
2724552  Sleuth  2007    Eve (II) Channing  actress
2724553  Sleuth  1972   Eve (III) Channing  actress
3370424  Sleuth  2007    Carmel O'Sullivan  actress

                          character    n
260242            Other Man on T.V.  NaN
326773                  Milo Tindle  2.0
326774                       Andrew  1.0
373876            Inspector Doppler  3.0
373877            Inspector Doppler  NaN
1293634                        Milo  2.0
1448690      Police Constable Higgs  6.0
1465483  Detective Sergeant Tarrant  4.0
1705394                 Andrew Wyke  1.0
1805907                 Man on T.V.  3.0
2724552             Marguerite Wyke  NaN
2724553             Marguerite Wyke  5.0
3370424                      Maggie  NaN

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

In [42]:


c=cast
c=c[c.title=='Sleuth']
d=c[c.year==2007]
print(d)

          title  year                 name     type          character    n
260242   Sleuth  2007      Kenneth Branagh    actor  Other Man on T.V.  NaN
326774   Sleuth  2007        Michael Caine    actor             Andrew  1.0
373877   Sleuth  2007  Alec (II) Cawthorne    actor  Inspector Doppler  NaN
1293634  Sleuth  2007             Jude Law    actor               Milo  2.0
1805907  Sleuth  2007        Harold Pinter    actor        Man on T.V.  3.0
2724552  Sleuth  2007    Eve (II) Channing  actress    Marguerite Wyke  NaN
3370424  Sleuth  2007    Carmel O'Sullivan  actress             Maggie  NaN

### How many roles were credited in the silent 1921 version of Hamlet?

In [44]:
c=cast
c=c[c.title=='Hamlet']
d=c[c.year==1921]
print(d)
len(d)

          title  year                    name     type         character    n
7789     Hamlet  1921        Fritz Achterberg    actor       Fortinbras,  9.0
458904   Hamlet  1921            Paul Conradi    actor      K?nig Hamlet  2.0
555034   Hamlet  1921        Anton De Verdier    actor           Laertes  7.0
1135279  Hamlet  1921         Hans Junkermann    actor          Polonius  6.0
2185558  Hamlet  1921            Heinz Stieda    actor           Horatio  5.0
2375993  Hamlet  1921  Eduard von Winterstein    actor          Claudius  4.0
2664423  Hamlet  1921         Mathilde Brandt  actress  K?nigin Gertrude  3.0
3062023  Hamlet  1921          Lilly Jacobson  actress           Ophelia  8.0
3355176  Hamlet  1921            Asta Nielsen  actress            Hamlet  1.0

9

### How many roles were credited in Branagh’s 1996 Hamlet?

In [45]:
c=cast
c=c[c.title=='Hamlet']
d=c[c.year==1996]
print(d)
len(d)

          title  year                    name     type  \
1731     Hamlet  1996              Riz Abbasi    actor
95861    Hamlet  1996    Richard Attenborough    actor
158642   Hamlet  1996     Simon Russell Beale    actor
214473   Hamlet  1996         David (V) Blair    actor
219554   Hamlet  1996           Brian Blessed    actor
250773   Hamlet  1996      Christopher Bowles    actor
260225   Hamlet  1996         Kenneth Branagh    actor
272749   Hamlet  1996          Richard Briers    actor
294652   Hamlet  1996          Michael Bryant    actor
319501   Hamlet  1996            Peter Bygott    actor
344365   Hamlet  1996       Kenneth W Caravan    actor
500916   Hamlet  1996           Billy Crystal    actor
518572   Hamlet  1996           Charles Daish    actor
576147   Hamlet  1996        G?rard Depardieu    actor
598618   Hamlet  1996          Reece Dinsdale    actor
604339   Hamlet  1996                Ken Dodd    actor
656817   Hamlet  1996             Rob Edwards    actor
669232   Hamlet  1996             Jimmy Ellis    actor
704270   Hamlet  1996        Nicholas Farrell    actor
708468   Hamlet  1996              Ray Fearon    actor
827066   Hamlet  1996            John Gielgud    actor
990819   Hamlet  1996         Charlton Heston    actor
1074691  Hamlet  1996           Ravil Isyanov    actor
1082161  Hamlet  1996            Derek Jacobi    actor
1210509  Hamlet  1996         Jeffery Kissoon    actor
1316617  Hamlet  1996             Jack Lemmon    actor
1400732  Hamlet  1996       Anthony Maddalena    actor
1417360  Hamlet  1996         Michael Maloney    actor
1489191  Hamlet  1996          Ian McElhinney    actor
1549128  Hamlet  1996              John Mills    actor
1556082  Hamlet  1996             Jimi Mistry    actor
1588218  Hamlet  1996       Frank (II) Morgan    actor
2040040  Hamlet  1996        Andrew Schofield    actor
2052796  Hamlet  1996           Orlando Seale    actor
2067657  Hamlet  1996            Rufus Sewell    actor
2151526  Hamlet  1996           Timothy Spall    actor
2154960  Hamlet  1996  John Spencer-Churchill    actor
2221910  Hamlet  1996         Thomas Szekeres    actor
2259675  Hamlet  1996                Ben Thom    actor
2404091  Hamlet  1996          Don Warrington    actor
2453099  Hamlet  1996          Robin Williams    actor
2500066  Hamlet  1996               David Yip    actor
2508377  Hamlet  1996             Jimmy Yuill    actor
2737885  Hamlet  1996          Julie Christie  actress
2814220  Hamlet  1996              Judi Dench  actress
2835947  Hamlet  1996          Angela Douglas  actress
2940033  Hamlet  1996           Yvonne Gidden  actress
2999610  Hamlet  1996         Rosemary Harris  actress
3119901  Hamlet  1996             Rowena King  actress
3154270  Hamlet  1996               Sarah Lam  actress
3451003  Hamlet  1996           Sian Radinger  actress
3456114  Hamlet  1996          Melanie Ramsay  actress
3728751  Hamlet  1996           Perdita Weeks  actress
3751232  Hamlet  1996            Kate Winslet  actress

                        character     n
1731        Attendant to Claudius   1.0
95861          English Ambassador   2.0
158642         Second Gravedigger  37.0
214473      Attendant to Claudius   3.0
219554   Ghost of Hamlet's Father   4.0
250773              Cadet in Play   NaN
260225                     Hamlet   5.0
272749                   Polonius   6.0
294652                     Priest   7.0
319501      Attendant to Claudius   8.0
344365                Laertes Mob   NaN
500916          First Gravedigger  10.0
518572              Stage Manager  11.0
576147                   Reynaldo  13.0
598618               Guildenstern  14.0
604339                     Yorick  15.0
656817                   Lucianus  17.0
669232             Old Fortinbras   NaN
704270                    Horatio  18.0
708468                  Francisco  19.0
827066                      Priam  21.0
990819                Player King  23.0
1074691                 Cornelius  24.0
1082161                  Claudius  25.0
1210509      Fortinbras's Captain  27.0
1316617                 Marcellus  29.0
1400732         Elsinore Courtier   NaN
1417360                   Laertes  31.0
1489191                  Barnardo  30.0
1549128                Old Norway  33.0
1556082                Sailor Two  34.0
1588218                   Pyrrhus   NaN
2040040                Young Lord  38.0
2052796                   Boatman   NaN
2067657                Fortinbras  39.0
2151526               Rosencrantz  40.0
2154960      Fortinbras's Captain  32.0
2221910              Young Hamlet  41.0
2259675              First Player  42.0
2404091                 Voltimand  43.0
2453099                     Osric  45.0
2500066                Sailor One  47.0
2508377                 Alexander   NaN
2737885                  Gertrude   9.0
2814220                    Hecuba  12.0
2835947     Attendant to Gertrude  16.0
2940033                    Doctor  20.0
2999610              Player Queen  22.0
3119901     Attendant to Gertrude  26.0
3154270     Attendant to Gertrude  28.0
3451003                  Prologue  35.0
3456114                Prostitute   NaN
3728751             Second Player  44.0
3751232                   Ophelia  46.0

54

### How many "Hamlet" roles have been listed in all film credits through history?

In [46]:
c=cast
c=c[c.title=='Hamlet']
# d=c[c.year==1921]
# print(d)
len(c)

342

### How many people have played an "Ophelia"?

In [53]:
c=cast
c=c[c.title=='Ophelia']

len(c)

20

### How many people have played a role called "The Dude"?

In [48]:
c=cast
c=c[c.title=='The Dude']

len(c)

0

### How many people have played a role called "The Stranger"?

In [49]:
c=cast
c=c[c.title=='The Stranger']

len(c)

106

### How many roles has Sidney Poitier played throughout his career?

In [51]:
c=cast
c=c[c.name=='Sidney Poitier']

len(c)

43

### How many roles has Judi Dench played?

In [54]:
c=cast
c=c[c.name=='Judi Dench']

len(c)

55

### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

In [57]:
c=cast
c=c[c.name=='Cary Grant']
d=c[c.year==1940]
e=d[d.n==2]
print(e)
len(e)

                   title  year        name   type   character    n
871423  My Favorite Wife  1940  Cary Grant  actor  Nick Arden  2.0

1

### List the leading roles that Cary Grant played in the 1940s in order by year.

In [58]:
c=cast
c=c[c.name=='Cary Grant']
d=c[c.year==1940]
print(d)
len(d)

                          title  year        name   type           character  \
871407          His Girl Friday  1940  Cary Grant  actor        Walter Burns
871423         My Favorite Wife  1940  Cary Grant  actor          Nick Arden
871448  The Howards of Virginia  1940  Cary Grant  actor         Matt Howard
871450   The Philadelphia Story  1940  Cary Grant  actor  C. K. Dexter Haven

          n
871407  1.0
871423  2.0
871448  1.0
871450  1.0

4

### How many roles were available for actors in the 1950s?

In [62]:
c=cast
# c=c[c.name=='Cary Grant']
d=c[c.year==1950]
e=d[d.type=="actor"]
print(e)
len(e)

                             title  year            name   type  \
288               Palletoori Pilla  1950  Subba Rao A.V.  actor
465                   Hallin Janne  1950  Kosti Aaltonen  actor
466                   Hallin Janne  1950  Kosti Aaltonen  actor
1564     Bomba and the Hidden City  1950  Abdullah Abbas  actor
1572     Fortunes of Captain Blood  1950  Abdullah Abbas  actor
...                            ...   ...             ...    ...
2531736           Restaurant Intim  1950   Steinar ?ster  actor
2531771            Den vita katten  1950     Alf ?stlund  actor
2531773       Flicka och hyacinter  1950     Alf ?stlund  actor
2531777         Medan staden sover  1950     Alf ?stlund  actor
2531779           Restaurant Intim  1950     Alf ?stlund  actor

                character     n
288         Kampanna Dora   4.0
465                 Rosvo   NaN
466               Vartija   NaN
1564             Villager   NaN
1572          Crew Member   NaN
...                   ...   ...
2531736              Cook   NaN
2531771  Ticket Collector  15.0
2531773     Viktor Ekberg   NaN
2531777         Andersson   NaN
2531779   Manager Nessing  15.0

[16760 rows x 6 columns]

16760

### How many roles were available for actresses in the 1950s?

In [63]:
c=cast
# c=c[c.name=='Cary Grant']
d=c[c.year==1950]
e=d[d.type=="actress"]
print(e)
len(e)

                           title  year               name     type  \
2532684   A Woman of Distinction  1950  Lucienne & Ashour  actress
2532686          Chain Lightning  1950  Lucienne & Ashour  actress
2533554        A Life of Her Own  1950     Dorothy Abbott  actress
2533558       Annie Get Your Gun  1950     Dorothy Abbott  actress
2533561            Copper Canyon  1950     Dorothy Abbott  actress
...                          ...   ...                ...      ...
3785342             Quinto patio  1950      Dalia ??iguez  actress
3785585                 Fukkatsu  1950      Chiharu ?tomo  actress
3785587  Harukanari haha no kuni  1950      Chiharu ?tomo  actress
3785752     Anderssonskans Kalle  1950   Ingrid ?stergren  actress
3786094       Akdeniz korsanlari  1950    Muazzez ?lkerer  actress

                                 character    n
2532684                     Apache Dancers  NaN
2532686                     Apache Dancers  NaN
2533554                              Model  NaN
2533558                     Carriage Woman  NaN
2533561                           Showgirl  NaN
...                                    ...  ...
3785342  Do?a Blanquita Z??iga de Vallarta  5.0
3785585                     Nagisa Fujioka  5.0
3785587                    May Takebayashi  NaN
3785752                Summer Camp Manager  NaN
3786094                              Maria  2.0

[5637 rows x 6 columns]

5637

### How many leading roles (n=1) were available from the beginning of film history through 1980?

In [64]:
c=cast

d=c[c.year==1980]
e=d[d.n==1]
print(e)
len(e)

                                     title  year                 name  \
1293                         Il pap'occhio  1980    Diego Abatantuono
1452               Athkiya' laken aghbiya'  1980         Rushdy Abaza
2543                     El Banat Ayza Eih  1980   Mahmoud Abdel Aziz
2558                 X Ma'anah Alamt Khata  1980   Mahmoud Abdel Aziz
2971                             Airplane!  1980  Kareem Abdul-Jabbar
...                                    ...   ...                  ...
3773192                      Majimak milae  1980             Ji-in Yu
3774562               Aduh aduh mana tahan  1980          Diana Yusuf
3779853                      Huang Ying Gu  1980        Jinling Zhang
3785490    Jokosei: natsu hiraku kuchiburu  1980            Ayako ?ta
3785492  Kairaku gakuen: Kinjirareta asobi  1980            Ayako ?ta

            type        character    n
1293       actor   Padre Gabriele  1.0
1452       actor            Hamdi  1.0
2543       actor            Kamal  1.0
2558       actor            Ramzy  1.0
2971       actor    Roger Murdock  1.0
...          ...              ...  ...
3773192  actress  Oh Yeong-kyeong  1.0
3774562  actress            Diana  1.0
3779853  actress     Yinggu Huang  1.0
3785490  actress     Sh?ko Yazaki  1.0
3785492  actress   Sachiko Suzuki  1.0

[1183 rows x 6 columns]

1183

### How many non-leading roles were available through from the beginning of film history through 1980?

In [65]:
c=cast

d=c[c.year==1980]
e=d[d.n>=1]
print(e)
len(e)

                                     title  year               name     type  \
197          Cheech and Chong's Next Movie  1980           Bobby A.    actor
459                           Aurinkotuuli  1980     Jouko Aaltonen    actor
641                            Raging Bull  1980          Bob Aaron    actor
1264                      Arrivano i gatti  1980  Diego Abatantuono    actor
1278                 Fantozzi contro tutti  1980  Diego Abatantuono    actor
...                                    ...   ...                ...      ...
3785492  Kairaku gakuen: Kinjirareta asobi  1980          Ayako ?ta  actress
3785582                   Tsigoineruwaizen  1980        Naoko ?tani  actress
3785583                   Tsigoineruwaizen  1980        Naoko ?tani  actress
3785800                              Akrep  1980        Ayfer ?zcan  actress
3785855                       Gerzek Saban  1980          ?lk? ?zen  actress

                            character     n
197                           Doorman  33.0
459                    Man on lecture  12.0
641                   Prison Guard #1  86.0
1264                           Felice  10.0
1278     Cecco, il nipote del fornaio   9.0
...                               ...   ...
3785492                Sachiko Suzuki   1.0
3785582                          Sono   2.0
3785583                         O-Ine   2.0
3785800                         Nevin   2.0
3785855                          Lale   2.0

[19006 rows x 6 columns]

19006

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?

In [68]:
c=cast

d=c[c.year==1980]
e=d[d.n==0]
print(e)
len(e)

Empty DataFrame
Columns: [title, year, name, type, character, n]
Index: []

0